In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,2,8,np.nan,6,3])

In [5]:
s

0    1.0
1    2.0
2    8.0
3    NaN
4    6.0
5    3.0
dtype: float64

In [6]:
dates = pd.date_range('20220212', periods=6)

In [7]:
dates

DatetimeIndex(['2022-02-12', '2022-02-13', '2022-02-14', '2022-02-15',
               '2022-02-16', '2022-02-17'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2022-02-12 -0.335732  1.212889  1.010735 -1.551773
2022-02-13 -0.411194  0.942484 -0.151605 -0.501247
2022-02-14  2.285031  0.104032  0.623262  1.535493
2022-02-15 -0.231547  0.383218  1.921289  0.784083
2022-02-16  0.848496 -0.557857 -0.404379  0.540659
2022-02-17 -1.167698 -1.275807 -0.188192  0.841987

In [15]:
df.head()

                   A         B         C         D
2022-02-12 -0.335732  1.212889  1.010735 -1.551773
2022-02-13 -0.411194  0.942484 -0.151605 -0.501247
2022-02-14  2.285031  0.104032  0.623262  1.535493
2022-02-15 -0.231547  0.383218  1.921289  0.784083
2022-02-16  0.848496 -0.557857 -0.404379  0.540659

In [16]:
df.tail(2)

                   A         B         C         D
2022-02-16  0.848496 -0.557857 -0.404379  0.540659
2022-02-17 -1.167698 -1.275807 -0.188192  0.841987

In [17]:
df.index

DatetimeIndex(['2022-02-12', '2022-02-13', '2022-02-14', '2022-02-15',
               '2022-02-16', '2022-02-17'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[-0.33573205,  1.21288911,  1.01073544, -1.55177332],
       [-0.41119388,  0.94248432, -0.15160517, -0.50124724],
       [ 2.28503091,  0.10403193,  0.62326164,  1.53549325],
       [-0.2315469 ,  0.38321774,  1.92128915,  0.78408274],
       [ 0.84849646, -0.55785712, -0.40437895,  0.54065856],
       [-1.16769802, -1.27580733, -0.18819154,  0.84198656]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.164559  0.134826  0.468518  0.274867
std    1.222928  0.932403  0.895127  1.111730
min   -1.167698 -1.275807 -0.404379 -1.551773
25%   -0.392328 -0.392385 -0.179045 -0.240771
50%   -0.283639  0.243625  0.235828  0.662371
75%    0.578486  0.802668  0.913867  0.827511
max    2.285031  1.212889  1.921289  1.535493

In [21]:
df.T

   2022-02-12  2022-02-13  2022-02-14  2022-02-15  2022-02-16  2022-02-17
A   -0.335732   -0.411194    2.285031   -0.231547    0.848496   -1.167698
B    1.212889    0.942484    0.104032    0.383218   -0.557857   -1.275807
C    1.010735   -0.151605    0.623262    1.921289   -0.404379   -0.188192
D   -1.551773   -0.501247    1.535493    0.784083    0.540659    0.841987

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-02-12 -1.551773  1.010735  1.212889 -0.335732
2022-02-13 -0.501247 -0.151605  0.942484 -0.411194
2022-02-14  1.535493  0.623262  0.104032  2.285031
2022-02-15  0.784083  1.921289  0.383218 -0.231547
2022-02-16  0.540659 -0.404379 -0.557857  0.848496
2022-02-17  0.841987 -0.188192 -1.275807 -1.167698

In [23]:
df.sort_values(by='B')

                   A         B         C         D
2022-02-17 -1.167698 -1.275807 -0.188192  0.841987
2022-02-16  0.848496 -0.557857 -0.404379  0.540659
2022-02-14  2.285031  0.104032  0.623262  1.535493
2022-02-15 -0.231547  0.383218  1.921289  0.784083
2022-02-13 -0.411194  0.942484 -0.151605 -0.501247
2022-02-12 -0.335732  1.212889  1.010735 -1.551773

In [24]:
df['A']

2022-02-12   -0.335732
2022-02-13   -0.411194
2022-02-14    2.285031
2022-02-15   -0.231547
2022-02-16    0.848496
2022-02-17   -1.167698
Freq: D, Name: A, dtype: float64

In [25]:
df[0:2]

                   A         B         C         D
2022-02-12 -0.335732  1.212889  1.010735 -1.551773
2022-02-13 -0.411194  0.942484 -0.151605 -0.501247

In [28]:
df['20220212':'20220207']

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [29]:
df.loc[dates[0]]

A   -0.335732
B    1.212889
C    1.010735
D   -1.551773
Name: 2022-02-12 00:00:00, dtype: float64

In [30]:
df.loc[:,['A','B']]

                   A         B
2022-02-12 -0.335732  1.212889
2022-02-13 -0.411194  0.942484
2022-02-14  2.285031  0.104032
2022-02-15 -0.231547  0.383218
2022-02-16  0.848496 -0.557857
2022-02-17 -1.167698 -1.275807

In [32]:
df.loc['20220212',['A','B']]

A   -0.335732
B    1.212889
Name: 2022-02-12 00:00:00, dtype: float64

In [33]:
df.loc[dates[0],'A']

-0.3357320524874817

In [34]:
df.at[dates[0],'A']

-0.3357320524874817

In [35]:
df.iloc[3]

A   -0.231547
B    0.383218
C    1.921289
D    0.784083
Name: 2022-02-15 00:00:00, dtype: float64

In [36]:
df.iloc[3:5,0:2]

                   A         B
2022-02-15 -0.231547  0.383218
2022-02-16  0.848496 -0.557857

In [37]:
df[df.A>0]

                   A         B         C         D
2022-02-14  2.285031  0.104032  0.623262  1.535493
2022-02-16  0.848496 -0.557857 -0.404379  0.540659

In [38]:
df[df>0]

                   A         B         C         D
2022-02-12       NaN  1.212889  1.010735       NaN
2022-02-13       NaN  0.942484       NaN       NaN
2022-02-14  2.285031  0.104032  0.623262  1.535493
2022-02-15       NaN  0.383218  1.921289  0.784083
2022-02-16  0.848496       NaN       NaN  0.540659
2022-02-17       NaN       NaN       NaN  0.841987

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one','two','three','four','three' ]

In [41]:
df2

                   A         B         C         D      E
2022-02-12 -0.335732  1.212889  1.010735 -1.551773    one
2022-02-13 -0.411194  0.942484 -0.151605 -0.501247    one
2022-02-14  2.285031  0.104032  0.623262  1.535493    two
2022-02-15 -0.231547  0.383218  1.921289  0.784083  three
2022-02-16  0.848496 -0.557857 -0.404379  0.540659   four
2022-02-17 -1.167698 -1.275807 -0.188192  0.841987  three

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2022-02-14  2.285031  0.104032  0.623262  1.535493   two
2022-02-16  0.848496 -0.557857 -0.404379  0.540659  four

In [43]:
s1 = pd.Series([1,2,3,4,5], index = pd.date_range('20130102',periods=5))

In [44]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
Freq: D, dtype: int64

In [45]:
df['F'] = s1

In [46]:
df.at[dates[0],'A'] = 0

In [47]:
df.iat[0,1] = 0

In [48]:
df.loc[:,'D'] = np.array([5] * len(df))

In [49]:
df

                   A         B         C  D   F
2022-02-12  0.000000  0.000000  1.010735  5 NaN
2022-02-13 -0.411194  0.942484 -0.151605  5 NaN
2022-02-14  2.285031  0.104032  0.623262  5 NaN
2022-02-15 -0.231547  0.383218  1.921289  5 NaN
2022-02-16  0.848496 -0.557857 -0.404379  5 NaN
2022-02-17 -1.167698 -1.275807 -0.188192  5 NaN

In [50]:
df2 = df.copy()

In [51]:
df2[df2 > 0] = -df2

In [52]:
df2

                   A         B         C  D   F
2022-02-12  0.000000  0.000000 -1.010735 -5 NaN
2022-02-13 -0.411194 -0.942484 -0.151605 -5 NaN
2022-02-14 -2.285031 -0.104032 -0.623262 -5 NaN
2022-02-15 -0.231547 -0.383218 -1.921289 -5 NaN
2022-02-16 -0.848496 -0.557857 -0.404379 -5 NaN
2022-02-17 -1.167698 -1.275807 -0.188192 -5 NaN